const set1 = new Set([1, 2, 3]);

console.log('Есть 3?', set1.has(3));
console.log('Есть 4?', set1.has(4));

set1.add(6).add(4).add(10).add(2).add(7);

for (const el of set1) {
    console.log(el);
}

const sum = [...set1].reduce((accum, Value) => accum + Value, 0);
console.log('Сумма:', sum);

console.log('Удаляем 5', set1.delete(5));
console.log('Удаляем 2', set1.delete(2));

set1.clear();
console.log(set1);

console.log([...new Set([1, 6, 9, 4, 9, 1, 5, 6])]);

const arrs = [...new Set([...[1, 6, 9, 4, 9, 1, 5, 6], ...[5, 10, 11]])];
console.log(arrs);

// 2.1. ✅ Створіть колекцію Set із початковими значеннями 1, 2, 3.
// За допомогою методу has перевірте наявність елемента зі значенням 3, а потім елемента зі значенням 4.
// Додайте ще кілька елементів.
// За допомогою циклу for-of переберіть колекцію та виведіть у консоль.
// Знайдіть суму цих значень.
// Видаліть елемент 2.
// Очистіть усю колекцію.

// 2.2. ✅ З масиву [1,6,9,4,9,1,5,6] отримати масив унікальних значень.
// З масивів [1,6,9,4,9,1,5,6] та [5, 10, 11] отримати один масив унікальних значень.